IDEA StatiCa Open Model
BeamData.AutoAddCutByWorkplane Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Automaticali add cut by workplane if it not defined
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool AutoAddCutByWorkplane { get; set; }
Public Property AutoAddCutByWorkplane As Boolean
	Get
	Set
public:
property bool AutoAddCutByWorkplane {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
BeamData Class
IdeaRS.OpenModel.Connection Namespace